/*
 * voice.h
 *
 * Created: 2014/7/19 13:07:41
 *  Author: oyx
 */ 


#ifndef VOICE_H_
#define VOICE_H_





#endif /* VOICE_H_ */

void send_char(unsigned char *testbuffer);
unsigned char DoWithTiaoJian(unsigned int *rdat);
void searchL(void);
    
#include <avr/pgmspace.h>

#define N  8
#define DELAY 50
#define DEVIDE 9
#define ConSize 7
#define SentSize 2
/*
#define start 122//judge接收
#define last  210
#define start12 975
#define last12  1515*/
#define Startcharlen 4
#define SELECT 2010
#define collectlen  3
const unsigned int start1[collectlen]={122,303/*,625,770*/};
const unsigned int last1[collectlen]={210,308/*,640,820*/};
const unsigned int start12[collectlen]={975,2424/*,78,96*/};
const unsigned int last12[collectlen]={1515,2464/*,80,103*/};

#define TEST  0//test 2 3个语音  test1 发送串口0xff test3 输入数据 0正常
struct word
{
	unsigned int con[ConSize];
	unsigned char sent[SentSize];
	struct word *next;
}*head,*pthis;
struct DoWith
{
	unsigned char howmany;
	unsigned int  what;
}DoWithS[8],factor[20];




#define CON_LENGTH 11
const unsigned int	conditon[CON_LENGTH][5]={//轨道位，语音位，男女平南上下行位（1下2上），后续factor位
								{1169,205,253},//x1lq
								{1165,206,253},//x2lq
								{1163,207,253},//x3lq
								{1159,215,254},//s1lq
								{2439,211,254,0,2},//{1171,211,254,0,2},//s1jg
								{2435,212,254,0,2},//{1173,212,254,0,2},//s2jg
								{2431,213,254,0,2},//{1167,213,254,0,2},//s3jg
								{1157,202,253,0,1},//x2jg
								{1083,204,253,0,1},//下进站
								{1033,214,254,1365,2},//上进站
								{2455,208,254}//1419
									//21
};
#define CON2_DEVIDE 2
#define CON2_LENGTH 5//0左1右
const unsigned int	conditon2[CON2_LENGTH][4]={{65535,0},
								{1084,0,0,0},//IAG
								{1034,1365,0,1},//4dg
								{986,1233,1225,0},//7-11
								{1038,1373,0,1}};//8dg}
unsigned char bcastflag=0,bcastnum=0,sendcastflag=0;	
 //定义uchar型的常量n定义在flash里(flash常量)
									
#define  LENGTH 15
//const unsigned char PROGMEM  s[5] =  { 1, 2, 3, 4, 5 };							
/*const unsigned int x_reserve[LENGTH][11]=//1、3左 2、4右 5左第一个道6、7正道8右边第一个道9、10、11轨道红
{ {0,0,0,0,0},	{1257,1425,0000,0000,996,1129,1129,1052,1130,1130,1130},//1
				{1313,1449,0000,0000,1014,1131,1131,1062,1132,1132,1132},//2
				{1269,1493,1258,1426,996,1133,1133,1068,1134,1134,1134},//3
				{1277,1497,1314,1450,1002,1135,1135,1078,1136,1136,1136},//4
				{1273,0000,1270,1494,1000,1137,1137,1068,1138,1138,1138},//5
				{1278,1510,0000,1498,1002,1139,1139,1078,1140,1140,1140},//6
				{1281,1466,1274,0000,1004,1141,1141,1072,1142,1142,1142},//7
				{1265,1509,1322,1498,998,1143,1143,1078,1144,1144,1144}, //8 
				{0,0,0,0,0},
				//{1293,1398,1282,1434,1012,1145,1145,1070,1146,1146,1146},//9 第二个
				{1266,1501,0000,1490,998,1147,1147,1082,1148,1148,1148},//10
				{0,0,0,0,0},
				//{1294,1458,1305,0000,1010,1149,1149},	//11
				{1254,1505,1261,1502,994,1151,1151,1082,1152,1152,1152},//12
				{0,0,0,0,0},
				{1262,1506,1261,1502,994,1153,1153,1082,1154,1154,1154}};//14*/
const unsigned int x_left[LENGTH][8]= {
		  {0,0},{1257,0000},//1	
			    {1313,0000},//2
				{1269,1258},//3
				{1277,1314},//4
				{1258,1270,1273},//5
				{1278,0000},//6
				{1258,1270,1274,1281},//7
				{1265,1322,1242},//8
				{1258,1270,1274,1282,1293,1305},//9
				{1266,1322,1242},//10
				{1258,1274,1282,1294,1301,1305},//11
				{1254,1261,1242},//12
				{0000,0000},//13
				{1254,1262,1242},//14								
};
const unsigned int x_right[LENGTH][8]={
		  {0,0},{1425,0000},//1	
			    {1449,0000},//2
				{1493,1465,0,0,0,0,1398,1426},//3
				{1497,1450,1485,1450},//4
				{1494,1465,0,0,0,0,1398,1426},//5
				{1498,1510,1485,1450},//6
				{1466,0000,0,0,0,0,1398,1426},//7
				{1509,1498,1485,1450},//8
				{1398,1457,0,0,0,0,1434,1410},//9
				{1501,1490,1486,1450},//10
				{1398,1458,0,0,0,0,1434,1410},//11
				{1505,1502,1490,1486,1450},//12
				{0000,0000},//13
				{1506,1502,1490,1486,1450},//14
};
const unsigned int x_left1[3][8]= {
	{0,0},{1257,0000},//1
	{1313,0000},//2
	
};
const unsigned int x_right1[3][8]={
	{0,0},{1425,0000},//1
	{1449,0000},//2

};
const unsigned int x_middle[LENGTH][7]={
		{0},{996,1052,1129,1129,1130,1130,1130},//1
			{1014,1062,1131,1131,1132,1132,1132},//2
			{996,1068,1133,1133,1134,1134,1134},//3
			{1002,1078,1135,1135,1136,1136,1136},//4
			{1000,1068,1137,1137,1138,1138,1138},//5
			{1002,1078,1139,1139,1140,1140,1140},//6
			{1004,1072,1141,1141,1142,1142,1142},//7
			{998,1078,1143,1143,1144,1144,1144},//8
			{1006,1070,1145,1145,1146,1146,1146},//9
			{998,1082,1147,1147,1148,1148,1148},//10
			{1010,1058,1149,1149,1150,1150,1150},//11
			{994,1082,1151,1151,1152,1152,1152},//12
			{0},//13
			{994,1082,1153,1153,1154,1154,1154},//14					
};
#define cachelen 25
#define cachelen1 15
volatile char rdatacache[cachelen+1][cachelen1]={0};

/*const unsigned char PROGMEM  s[260][5] =  {"",
"下行一道发车信号开放",
"下行2道发车信号开放",
"下行3道发车信号开放",
"下行4道发车信号开放",
"下行5道发车信号开放",
"下行6道发车信号开放",
"下行7道发车信号开放",
"下行8道发车信号开放",
"下行9道发车信号开放",
"下行十道发车信号开放",
"下行十一道发车信号开放",
"下行十2道发车信号开放",
"下行十3道发车信号开放",
"下行十4道发车信号开放",
"下行十5道发车信号开放",
"下行十6道发车信号开放",
"下行十7道发车信号开放",
"下行十8道发车信号开放",
"下行十9道发车信号开放",
"下行2十道发车信号开放",
"下行一道接车信号开放",
"下行2道接车信号开放",
"下行3道接车信号开放",
"下行4道接车信号开放",
"下行5道接车信号开放",
"下行6道接车信号开放",
"下行7道接车信号开放",
"下行8道接车信号开放",
"下行9道接车信号开放",
"下行十道接车信号开放",
"下行十一道接车信号开放",
"下行十2道接车信号开放",
"下行十3道接车信号开放",
"下行十4道接车信号开放",
"下行十5道接车信号开放",
"下行十6道接车信号开放",
"下行十7道接车信号开放",
"下行十8道接车信号开放",
"下行十9道接车信号开放",
"下行2十道接车信号开放",
"下行一道通过信号开放",
"下行2道通过信号开放",
"下行3道通过信号开放",
"下行4道通过信号开放",
"下行5道通过信号开放",
"下行6道通过信号开放",
"下行7道通过信号开放",
"下行8道通过信号开放",
"下行9道通过信号开放",
"下行十道通过信号开放",
"下行十一道通过信号开放",
"下行十2道通过信号开放",
"下行十3道通过信号开放",
"下行十4道通过信号开放",
"下行十5道通过信号开放",
"下行十6道通过信号开放",
"下行十7道通过信号开放",
"下行十8道通过信号开放",
"下行十9道通过信号开放",
"下行2十道通过信号开放",
"进一道停车",
"进2道停车",
"进3道停车",
"进4道停车",
"进5道停车",
"进6道停车",
"进7道停车",
"进8道停车",
"进9道停车",
"进十道停车",
"进十一道停车",
"进十2道停车",
"进十3道停车",
"进十4道停车",
"进十5道停车",
"进十6道停车",
"进十7道停车",
"进十8道停车",
"进十9道停车",
"进2十道停车",
"经一道通过",
"经2道通过",
"经3道通过",
"经4道通过",
"经5道通过",
"经6道通过",
"经7道通过",
"经8道通过",
"经9道通过",
"经十道通过",
"经十一道通过",
"经十2道通过",
"经十3道通过",
"经十4道通过",
"经十5道通过",
"经十6道通过",
"经十7道通过",
"经十8道通过",
"经十9道通过",
"经2十道通过",
"上行一道发车信号开放",
"上行2道发车信号开放",
"上行3道发车信号开放",
"上行4道发车信号开放",
"上行5道发车信号开放",
"上行6道发车信号开放",
"上行7道发车信号开放",
"上行8道发车信号开放",
"上行9道发车信号开放",
"上行十道发车信号开放",
"上行十一道发车信号开放",
"上行十2道发车信号开放",
"上行十3道发车信号开放",
"上行十4道发车信号开放",
"上行十5道发车信号开放",
"上行十6道发车信号开放",
"上行十7道发车信号开放",
"上行十8道发车信号开放",
"上行十9道发车信号开放",
"上行2十道发车信号开放",
"上行一道接车信号开放",
"上行2道接车信号开放",
"上行3道接车信号开放",
"上行4道接车信号开放",
"上行5道接车信号开放",
"上行6道接车信号开放",
"上行7道接车信号开放",
"上行8道接车信号开放",
"上行9道接车信号开放",
"上行十道接车信号开放",
"上行十一道接车信号开放",
"上行十2道接车信号开放",
"上行十3道接车信号开放",
"上行十4道接车信号开放",
"上行十5道接车信号开放",
"上行十6道接车信号开放",
"上行十7道接车信号开放",
"上行十8道接车信号开放",
"上行十9道接车信号开放",
"上行2十道接车信号开放",
"上行一道通过信号开放",
"上行2道通过信号开放",
"上行3道通过信号开放",
"上行4道通过信号开放",
"上行5道通过信号开放",
"上行6道通过信号开放",
"上行7道通过信号开放",
"上行8道通过信号开放",
"上行9道通过信号开放",
"上行十道通过信号开放",
"上行十一道通过信号开放",
"上行十2道通过信号开放",
"上行十3道通过信号开放",
"上行十4道通过信号开放",
"上行十5道通过信号开放",
"上行十6道通过信号开放",
"上行十7道通过信号开放",
"上行十8道通过信号开放",
"上行十9道通过信号开放",
"上行2十道通过信号开放",
"进一道停车",
"进2道停车",
"进3道停车",
"进4道停车",
"进5道停车",
"进6道停车",
"进7道停车",
"进8道停车",
"进9道停车",
"进十道停车",
"进十一道停车",
"进十2道停车",
"进十3道停车",
"进十4道停车",
"进十5道停车",
"进十6道停车",
"进十7道停车",
"进十8道停车",
"进十9道停车",
"进2十道停车",
"经一道通过",
"经2道通过",
"经3道通过",
"经4道通过",
"经5道通过",
"经6道通过",
"经7道通过",
"经8道通过",
"经9道通过",
"经十道通过",
"经十一道通过",
"经十2道通过",
"经十3道通过",
"经十4道通过",
"经十5道通过",
"经十6道通过",
"经十7道通过",
"经十8道通过",
"经十9道通过",
"经2十道通过",
"下行列车一接近",
"下行列车2接近",
"下行列车3接近",
"下行列车进站",
"下行列车一离去",
"下行列车2离去",
"下行列车3离去",
"下行列车出站",
"空",
"空",
"上行列车一接近",
"上行列车2接近",
"上行列车3接近",
"上行列车进站",
"上行列车一离去",
"上行列车2离去",
"上行列车3离去",
"上行列车出站",
"空",
"空",
"保定南信息中断",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"空",
"保定南",
"保定南",
}; */