#include <avr/pgmspace.h>
//道岔***
const unsigned short PROGMEM dat0[][11]={
{345,361,373,365},
{361,346},
{353,345,299},             //IIG_R  语音表第3行内容为102,IIG的发车????
{362,346},
{354,345},
{345,361},
{345,362},
{365,381,353,345},
{373,365,297},            //IG_R  语音表第16行内容为1 ，IG的发车????
{374,365},
{366,373},
{365,381},
{366,374},
{365,382},
};
//轨道***
const unsigned short PROGMEM dat2[][13]={
{276,280,298,286,284},
{276,280,298,286,284},
{274,292},
{280,276,274,292},
{278,274,292},
{276,280,298},
{276,280,302},
{294,282,300,274,292},
{286,284},
{288,286,284},
{294,282,284,286,298},
{294,282,300},
{294,282,284,286,288,302},
{294,282,290,304},
};

//信号机X-L X-LU/XI-L XI-LU XI-U   ***
unsigned short dat5[][2][3]={
{{1,5},{135,140,138}},    //{X-L,X-LU},{XI-L,XI-LU,XI-U},//XI-L
{{71,76,74}},             //{{SI-L,SI-LU,SI-U}},
{{87,92,90}},          //{{SII-L,SII-LU,SII-U}},
{{103,108,106}},             //{{SIII-L,SIII-LU,SIII-U}},
{{119,124,122}},       //{{SIV-L,SIV-LU,SIV-U}},
{{3}},                 //{{X-U}},
{{6,7}},                 //{{X-UU,X-USU}},                           X_YFY??????
{{43,47},{87,92,90}},    //{{S-L,S-LU},{SII-L,SII-LU,SII-U}},
{{135,140,138}},            //{{XI-L,XI-LU,XI-U}},
{{167,172,170}},           //{{XIII-L,XIII-LU,XIII-U}},
{{48}},                   //{{S-UU}},
{{45}},                //{{S-U}},
{{48}},                //{{S-UU}},
{{48}},                //{{S-UU}},
};


//北京接车1 商丘接车2 北京发车3  商丘发车4 德州接车5 石家庄接车6 德州发车7 石家庄发车8   //***
unsigned short dat4[][2]={
{1,4},                //进路号9/27
{3},
{3},
{3},
{3},
{1},
{1},
{2,3},              //进路号30/6
{4},
{4},
{2},
{2},
{2},
{2}
};
//语音播报 txt 行数   ***
unsigned short dat3[]={
41,               //下行一道通过信号开放
101,              //上行一道发车信号开放
102,              //上行二道发车信号开放
103,              //3G
104,              //4G
21,               //下行一道接车信号开放
23,               //下行3道接车信号开放
142,              //上行2道通过信号开放
1,                //下行一道发车信号开放
3,                //下行3道发车信号开放  
121,               //上行一道接车信号开放 
122,               //2G
123,               //3G 
124                //4G
};

//***
#define CON_LENGTH 14             //[3]counter 4[daocha]  LENGTH修改，一般不变
unsigned short	conditon[CON_LENGTH][5]={
	{305,201,1},//x1jg-h
	{307,202,1},//x2jg
	{309,203,1},//x3jg
	{275,204,1},//xjz-H          X进站第一个区段 3DG
	{325,205},//x1lq-H
	{321,206},//x2lq
	{323,207},//x3lq
	{327,211,2},//{1171,211,254,0,2},//s1jg
	{329,212,2},//{1173,212,254,0,2},//s2jg
	{319,213,2},//{1167,213,254,0,2},//s3jg
	{293,214,2},//sjz-H       S进站第一个区段  IIBG
	{315,215},//s1lq
	{313,216},//s2lq
	{311,217}//s3lq


	
	//{2455,208}//1419       //区间信号点1419
	
};
 
//***
unsigned short factor[5][4]={
	 {0},
	 {0,0,276},//xjz-b  X进站第一个区段3DG-B
	 {0,0,294},//sjz-b  S进站第一个区段IIBG-B
	 {0,0,292},//scz-b  S出站最后一个区段（XF前一个区段） IIAG_B
	 {0,0,284}//xcz-b   X出站最后一个区段（SF前一个区段） 4DG-B
	 };