#include <avr/pgmspace.h>
//道岔
const unsigned short PROGMEM dat0[][11]={
{329,341,321,313},
{337,329,269},
{338,329},
{329,341},
{330,337},
{329,342},
{330,338},
{313,325,337,329},
{341,313,267},
{326,313},
{325,314},
{322,313},
{326,314},
{313,325},
};
//轨道
const unsigned short PROGMEM dat2[][13]={
{266,256,262,268,250,264},
{260,258},
{260,258},
{266,256,262,268},
{266,256,258,260,270},
{266,256,262,272},
{266,256,258,260,274},
{252,254,270,260,258},
{250,264},
{254,252,250,264},
{250,264},
{254,252,250,264},
{252,254,270},
{252,254,274},
};
//信号机X-L X-LU/XI-L XI-LU XI-U   ***
unsigned short dat5[][2][3]={
{{15,19},{57,62,60}},   
{{137,142,140}},             
{{169,174,172}},          //{{S4-L,S4-LU,S4-U}},
{{31}},             //{{X-U}},
{{34}},       //{{X-UU}},
{{34}},                 //{{X-UU}},
{{34}},                 //{{X-UU}},  
{{15,19},{137,142,140}},    //{{S-L,S-LU},{SII-L,SII-LU,SII-U}},
{{57,62,60}},            //{{XI-L,XI-LU,XI-U}},
{{73,78,76}},           //{{XII-L,XII-LU,XII-U}},
{{89,94,92}},           //{{X3-L,X3-LU,X3-U}},
{{105,110,108}},           //{{X4-L,X4-LU,X4-U}},                           
{{17}},                   //{{S-U}},
{{17}},                //{{S-UU}},

};
//北京接车1 九龙接车2 北京发车3 九龙发车4   
unsigned short dat4[][2]={
{1,4},                //????????????
{3},
{3},
{1},
{1},
{1},
{1},
{3,2},              //?????????????
{4},
{4},
{4},
{4},
{2},
{2}
};
//语音播报 txt 行数   ***
unsigned short dat3[]={
41,               //下行一道通过信号开放
102,              //上行二道发车信号开放
104,              //上行4道发车信号开放
21,               //下行一道接车信号开放
22,               //下行二道接车信号开放
23,              //下行3道接车信号开放
24,                //下行4道接车信号开放 
142,               //上行二道通过信号开放
1,               //下行一道发车信号开放
2,               //下行二道发车信号开放 
3,                //下行3道发车信号开放
4,               //下行4道发车信号开放 
122,                //上行二道接车信号开放 
124                //上行4道接车信号开放 
};

//***
#define CON_LENGTH 14             //[3]counter 4[daocha]  LENGTH修改，一般不变
unsigned short	conditon[CON_LENGTH][5]={
{287,201,1},//x1jg-h
{289,202,1},//x2jg
{291,203,1},//x3jg
{265,204,1},//xjz-H          X进站第一个区段IAG
{281,205},//x1lq-H
{275,206},//x2lq
{277,207},//x3lq
{283,211,2},//s1jg
{285,212,2},//s2jg
{279,212,2},//s3jg
{251,214,2},//sjz-H       S进站第一个区段  4DG
{297,215},//s1lq
{295,216},//s2lq
{293,217}//s3lq	
};
 
//***
unsigned short factor[5][4]={
	 {0},
	 {0,0,266},//xjz-b  X进站第一个区段IAG-B
	 {0,0,252},//sjz-b  S进站第一个区段4DG-B
	 {0,0,258},//scz-b  S出站最后一个区段（XF前一个区段） 3DG_B
	 {0,0,264}//xcz-b   X出站最后一个区段（SF前一个区段） IBG-B
	 };