/*
 * voice.h
 *
 * Created: 2014/7/19 13:07:41
 *  Author: oyx
 */ 

//双数白 单数红
#ifndef VOICE_H_
#define VOICE_H_





#endif /* VOICE_H_ */

void send_char(unsigned char *testbuffer);
unsigned char DoWithTiaoJian(unsigned int *rdat);
void searchL(void);

//#include <avr/pgmspace.h>
#define size 470
#define N  8
#define DELAY 50
#define DEVIDE 9
#define ConSize 7
#define SentSize 2
#define Startcharlen 4
#define SELECT 2006
#define collectlen  3
const unsigned int start12[collectlen]={0,888,2176/*,625,770*/};
const unsigned int last12[collectlen]={240,1014,2200/*,640,820*/};
const unsigned int start1[collectlen]={0,109,272/*,78,96*/};
const unsigned int last1[collectlen]={30,128,275/*,80,103*/};

#define TEST   0//test 2 3个语音  test1 发送串口0xff test3 输入数据 0正常
struct word
{
	unsigned int con[ConSize];
	unsigned char sent[SentSize];
	struct word *next;
}*head,*pthis;
struct DoWith
{
	unsigned char howmany;
	unsigned int  what;
}DoWithS[8],factor[20];




#define CON_LENGTH 22
const unsigned int	conditon[CON_LENGTH][5]={//轨道位，语音位，男女平南上下行位（1下2上），后续factor位
								{167,205,253},//x1lq
								{161,206,253},//x2lq
								{163,207,253},//x3lq
								{225,215,254},//s1lq
								{221,216,254},//s2lq
								{217,217,254},//s3lq
								{169,211,254,0,2},//s1jg
								{171,212,254,0,2},//s2jg
								{165,213,254,0,2},//s3jg
								{211,201,253,0,1},//x1jg
								{215,202,253,0,1},//x2jg
								{219,203,253,0,1},//x3jg
								{7,204,253,893},//下进站
								{41,214,254,927},//上进站
								{87,204,253},//支线进站
								{179,221,253,0,3},//支线一接近
								{191,222,253,0,3},//支线二接近
								{199,223,253,0,3},//支线三接近
								{189,226,254},//支线一离去
								{185,227,254},//支线二离去
								{177,228,254}//支线三离去
									//21
};
#define CON2_DEVIDE 3
#define CON2_LENGTH 7
const unsigned int	conditon2[CON2_LENGTH][4]={{65535,0},
								{8,893},//11-19DG
								{42,927,0,1},//6DG
								{88},//XHAG 
								{12,895},//15DG
								{92},//12AG 
								{100,925,0,1}};//IBG}
unsigned char bcastflag=0,bcastnum=0,sendcastflag=0;	
//const unsigned char PROGMEM  s[5] =  { 1, 2, 3, 4, 5 };  //定义uchar型的常量n定义在flash里(flash常量)
									
#define  LENGTH 15							
/*const unsigned int x_reserve[LENGTH][11]=//1、3左 2、4右 5左第一个道6、7正道8右边第一个道9、10、11轨道红
{ {0,0,0,0,0},	{1257,1425,0000,0000,996,1129,1129,1052,1130,1130,1130},//1
				{1313,1449,0000,0000,1014,1131,1131,1062,1132,1132,1132},//2
				{1269,1493,1258,1426,996,1133,1133,1068,1134,1134,1134},//3
				{1277,1497,1314,1450,1002,1135,1135,1078,1136,1136,1136},//4
				{1273,0000,1270,1494,1000,1137,1137,1068,1138,1138,1138},//5
				{1278,1510,0000,1498,1002,1139,1139,1078,1140,1140,1140},//6
				{1281,1466,1274,0000,1004,1141,1141,1072,1142,1142,1142},//7
				{1265,1509,1322,1498,998,1143,1143,1078,1144,1144,1144}, //8 
				{0,0,0,0,0},
				//{1293,1398,1282,1434,1012,1145,1145,1070,1146,1146,1146},//9 第二个
				{1266,1501,0000,1490,998,1147,1147,1082,1148,1148,1148},//10
				{0,0,0,0,0},
				//{1294,1458,1305,0000,1010,1149,1149},	//11
				{1254,1505,1261,1502,994,1151,1151,1082,1152,1152,1152},//12
				{0,0,0,0,0},
				{1262,1506,1261,1502,994,1153,1153,1082,1154,1154,1154}};//14*/
const unsigned int x_left[LENGTH][8]= {
		  {0,0},{897,899,905},//1	
			    {917},//2
				{897,899,906,909},//3
				{916,914,904},//4
				{897,899,906,910,911},//5
				{915,914,904},//6
				{897,899,906,910,912},//7
				{0},//8
				{0},//9
				{913,904},//10
				{0},//11
				{0,0,0,0,0,0,0,0},//12
				{0,0},//13
				{918},//14								
};
const unsigned int x_right[LENGTH][8]={
		 {0,0},{941},//1
			   {933,927},//2
			   {942,951},//3
			   {940,946,950},//4
			   {942,952,953},//5
			   {940,946,949},//6
			   {942,952,954},//7
			   {0},//8
			   {0},//9
			   {940,945},//10
			   {0},//11
			   {939,0,0,0,0,0,0,0},//12
			   {0,0},//13
			   {933,927},//14
};
const unsigned int x_middle[LENGTH][7]={
		{0},{16,70,115,115,116,116,116},//1
			{34,58,117,117,118,118,118},//2
			{26,82,119,119,120,120,120},//3
			{32,80,121,121,122,122,122},//4
			{26,82,123,123,124,124,124},//5
			{32,80,125,125,126,126,126},//6
			{28,86,127,127,128,128,128},//7
			{0},//8
			{0},//9
			{30,76,129,129,130,130,130},//10
			{0},//11
			{18,66,131,131,132,132,132},//12
			{0},//13
			{34,50,133,133,134,134,134},//14					
};

 unsigned int signal[4]={0,2,0,62};

#define cachelen 10		
#define cachelen1 40									  
volatile char rdatacache[cachelen+1][cachelen1]={0};